Rebar can't be placed in a non-structural element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidRebarHostNonStructural { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidRebarHostNonStructural As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidRebarHostNonStructural {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace